# Напишите программу для вывода на экран чисел от 0 до 100
# Вам понадобится цикл for, конструкция range и print

for i in range(101):
    print(i)